import emperatori_code_jaei_baraye_noavari_va_yadgiri from "../assets/blogs/emperatori-code-jaei-baraye-noavari-va-yadgiri.png";
import barnamehnevisi_ta_movafaiaghit_ranpannamayi_baraye_ayandehsazan from "../assets/blogs/barnamehnevisi-ta-movafaiaghit-ranpannamayi-baraye-ayandehsazan.png";
import barnameh_nevisi_baraye_farzandan from "../assets/blogs/barnameh-nevisi-baraye-farzandan.jpeg";
import niaz_haye_aqaz_barnameh_nevisi from "../assets/blogs/niaz-haye-aqaz-barnameh-nevisi.png";
import barnameh_nevisi_chist from "../assets/blogs/barnameh-nevisi-chist.png";

export const blogs = [
  {
    title: "برنامه نویسی چیست؟",
    cover: barnameh_nevisi_chist,
    category: "برنامه نویسی",
    author: "پارسا عربی",
    upload: "مرداد 1403",
    suggested: 12,
    paragraphs: [
      {
        title: "برنامه نویسی چیست؟",
        paragraph: [
          "برنامه نویسی دانشی هست برای انتقال دستورات و ایده‌ها به کامپیوتر و در نهایت اجرای آنها توسط کامپیوتر.",
        ],
      },
      {
        title: "یعنی برنامه نویسی دقیقا چه میکنه؟",
        paragraph: [
          "اگر بخوایم واضح تر بگیم برنامه نویسی دقیقا همون دانشی هست که سبب شده دنیای کامپیوتر پیدایش و گسترش پیدا کنه و دقیقا همون دانشی هست که سبب شده وب‌سایت‌ها و بازی‌ها و نرم افزار ها و هوش مصنوعی به وجود بیاد.",
        ],
      },
      {
        title: "برنامه نویسی شامل چه چیزاییست؟",
        paragraph: [
          "دانش برنامه‌نویسی در واقع شامل انواع گوناگونی از زبان‌های برنامه نویسی و فریم ورک هست، بنا به هدف خود و چیزی که میخوایم فرایند و توسعه‌اش را انجام بدیم باید زبان و فریم ورک‌های مناسب رو برگزینیم!",
        ],
      },
      {
        title: "چه زبان برنامه‌نویسی یاد بگیریم؟",
        paragraph: [
          " بستگی به علاقه و هدف شما داره !مثلا اگر بخواین طراحی سایت انجام بدین باید HTML و CSS و JavaScript و فریم ورک های مرتبط رو یاد بگیرین. ما نقشه راه و توضیحات کاملی رو در هر زمینه‌ای از برنامه نویسی تقدیمتون میکنیم + مشاوره رایگان .",
        ],
      },
      {
        title: "قدم های بعدی",
        paragraph: [
          "خب رفقا و همراهان امپراتوری کد ممنونیم که نخستین مقاله ما که از مهمترین مقاله‌هامونم هست خوندین، امیدواریم خوندنش بهتون چسبیده باشه و یاد گرفته باشید.",
        ],
      },
    ],
    faq: {
      "@context": "https://schema.org",
      "@type": "FAQPage",
      mainEntity: [
        {
          "@type": "Question",
          name: "برنامه نویسی چیه؟",
          acceptedAnswer: {
            "@type": "Answer",
            text: "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
          },
        },
        {
          "@type": "Question",
          name: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
          acceptedAnswer: {
            "@type": "Answer",
            text: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
          },
        },
        {
          "@type": "Question",
          name: "کاربرد برنامه نویسی چیه؟",
          acceptedAnswer: {
            "@type": "Answer",
            text: "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
          },
        },
        {
          "@type": "Question",
          name: "بازار کار و درآمد برنامه نویسی چطوره؟",
          acceptedAnswer: {
            "@type": "Answer",
            text: "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
          },
        },
      ],
    },
  },
  {
    title: "نیاز های برنامه نویسی",
    cover: niaz_haye_aqaz_barnameh_nevisi,
    category: "برنامه نویسی",
    author: "پارسا عربی",
    upload: "مرداد 1403",
    suggested: 15,
    paragraphs: [
      {
        title: "پیشگفتار",
        paragraph: [
          "خوش آمدی! تو این مقاله میخونی که برنامه نویسی چه پیش نیاز هایی میخواد، خوشبختانه پیش نیاز‌های پیچیده‌ای نمیخواد ولی خب مهم هستن برای آغاز این کار.",
        ],
      },
      {
        title: "ساده‌ترین پیش نیاز",
        paragraph: [
          "اگه میخوای برنامه نویسی رو با حس خوب یاد بگیری و براش هدف داشته باشی لازمه که بهش علاقه داشته باشی، اینجوری هم خیلی لذت میبری از یادگیری هم هدف مشخصی داری",
        ],
      },
      {
        title: "امکانات لازم برنامه‌ نویسی",
        paragraph: [
          "شما برای برنامه نویسی به بستر این کار نیاز داری، یعنی چیزی که باهاش برنامه نویسی میکنن، بله درسته « کامپیوتر یا لپ تاپ ». چیز خاصی هم نمیخواد تهیه کنید، یک کامپیوتر یا لپ تاپ ساده برای آغاز کار کافیه، در آینده میتوانید لپ تاپ بهتری بخرید یا کامپیوترتون رو ارتقاء بدین و روز به روز بهترش کنید. پس جای نگرانی نیست!",
        ],
      },
      {
        title: "علاقه دارم، پول ندارم!",
        paragraph: [
          "شاید مشکلت الان تهیه یک سیستم ساده باشه ولی پولت کافی نباشه، درکت میکنم ولی راهکار دارم. چندتا راهکار خوب به شما میدیم که شما هم سیستم شخصی خودت رو داشته باشی:",
        ],
        hints: [
          " از دوستان یا آشنایانت زیر قیمت بخر (نو یا کار کرده فرقی نمیکنه، سالم و مناسب باشه)",
          "تهاتر بزن! (چیزی که داری اما خیلی برات مهم نیست بده و بجاش لپ تاپ بگیر، اگر لازم بود کمی هم پول میدی) اینم راه خوبیه!",
          "اگه راهکار های بالا رو دوست نداشتی پیشنهادمون اینه که لپ تاپ استوک تهیه کنی",
          " اگه حتما سیستم نو میخوای میتونی از وام و  قرض کمک بگیری، اقساطی بخری، با تهاتر بخری!",
        ],
      },
      {
        paragraph: [
          "اینها همه راهکار های موجود بود که انتخاب هر کدوم بستگی به شما داره اما چیزی رو از ما بشنو: این روزها در هر صورت داشتن سیستم (کامپیوتر یا لپ تاپ) مهمه! پس هر چه زودتر اقدام کن دوست من:)",
        ],
      },
      {
        title: "چجوری هزینه‌ها را جبران کنم!",
        paragraph: [
          "خب بلاخره پولی که به هر شکلی برای تهیه یک سیستم خرج کردی رو باید در بیاری یا حتی بیشتر از چیزی که خرج کردی،‌ اگر هدفت پول در آوردن از برنامه نویسی باشه مطمئن باش برنامه نویسی خیلی بیشتر از اون چیزی که میخوای در مدت زمانی نسبتا کوتاه میتونه بهت بده ولی باید بخوای تا بهت بده!",
          "اینم گفتیم که نگران جبران هزینه نباشی اگه از ما تضمین میخوای مشکلی نیست، شما میتونی پس از یادگیری شاخه‌ای از برنامه نویسی تو مجموعه ما یعنی ( امپراتوری کد ) مشغول به کار بشی! خوبه رفیق؟",
          "راه پیشرفت و درآمدزایی تو برنامه نویسی خیلی خوبه ولی باید بخواین و تلاش کنین...",
        ],
      },
      {
        title: "پایان و چکیده مقالمون",
        paragraph: [
          "اگه واقعا تصمیم داری یاد بگیری، اگه هدف داری پس درنگ نکن هر چه زودتر آغاز کن. اگر سیستم هم داری پس دیگه مشکلی نیست، اگر سیستمت خیلی خوب نیست یکم ارتقاء میدی و کار رو شروع میکنی.",
        ],
      },
    ],
  },
  {
    title: "برنامه نویسی برای فرزندان",
    cover: barnameh_nevisi_baraye_farzandan,
    category: "برنامه نویسی",
    author: "پارسا عربی",
    upload: "مرداد 1403",
    suggested: 15,
    paragraphs: [
      {
        title: "پیشگفتار",
        paragraph: [
          "پدر یا مادر عزیز خیلی خوشحالیم که این مقاله رو میخونید، بدون شک یکی از مهمترین دغدغه‌های شما موفقیت فرزندانتون هست و از دل و جان دوست دارین هر کاری از دستتون بر میاد برای آگاهی و یادگیری و رشد و پیشرفت فرزندتون انجام بدین.",
          "ما همیشه سپاسگزار زحمات و لطف‌های بی‌کران شما هستیم🙏 به همین دلیل این مقاله رو براتون آماده کردیم تا کمکتون کنیم و شاید بخش ناچیزی از محبتاتون رو جبران کنیم...",
        ],
      },
      {
        title: "پیشنهاد ما به شما",
        paragraph: [
          "حتما دوست دارین که فرزندتون مهارت و دانشی یاد بگیره که بتونه ازش استفاده تا آیندش رو بسازه، مهارتی که هیچگاه از یادگیریش پشیمان نشه. خب اگر بخوایم بر اساس نیاز و اتفاقات جامعه و با آینده نگری پیشنهادی به شما بدیم بی‌شک برنامه نویسی یکی از بهترین پیشنهاداست.",
        ],
      },
      {
        title: "چرا برنامه نویسی؟",
        paragraph: [
          "چون یکی از پرکاربرد ترین دانش های امروزه و روز به روز اهمیتش بیشتر میشه، بیاید باهم یک بررسی انجام بدیم، وبسایت‌ها، بازی ها، نرم افزار ها و اپلیکیشن ها، سیستم عامل ها، هوش مصنوعی، همه اینها با برنامه نویسی ساخته شدن. خواهان اینهایی که گفتیم چه کسانی هستن؟ پاسخ « هر شخص یا شرکتی ممکنه نیاز داشته باشه » پس ببینید چقدر موقعیت شغلی و درآمدزایی برای برنامه نویسان وجود داره!",
        ],
      },
      {
        title: "از کجا شروع کنیم؟",
        paragraph: [
          "باید منبع مناسبی رو برای یادگیری برنامه نویسی انتخاب کنید تا فرزندتون گام به گام یاد بگیره، ما با افتخار و اطمینان به شما عزیزان اعلام میکنیم که نه تنها به فرزندانتون آموزش میدیم بلکه صفر تا صدم همراه فرزندتون هستیم. راستی یک کامپیوتر یا لپ تاپ مناسب برنامه‌نویسی هم اگر ندارید تهیه کنید، مدل نسبتا ساده‌ای هم تهیه کنید کافیه.",
        ],
      },
      {
        title: "چقدر زمان میبره یادگیریش؟",
        paragraph: [
          "بسته به شاخه‌ای که برمیگزینید و اینکه خودتون چقدر تلاش کنید ممکنه چند ماه تا یک سال زمان ببره. البته راه شما میتونه ادامه داشته باشه و روز به روز بیشتر یاد بگیرید و مهارتتون رو تقویت کنید.",
        ],
      },
      {
        title: "پایان و چکیده مقاله",
        paragraph: [
          "بهترین هدیه برای فرزندتون اینه که با کمک اهل فن‌ها و متخصصین راهنماییش کنید تا آینده خودش رو بسازه. در این مقاله هم مانند مقالات پیشین تلاش بر این بود که نکات و تجارب را کامل و مفید به شما بزرگواران ارائه بدیم، حال اگر پرسش یا نظری هم دارید مشتاقانه می‌پذیریم.",
        ],
      },
    ],
  },
  {
    title: "برنامه‌نویسی تا موفقیت: راهنمایی برای آینده‌سازان",
    cover: barnamehnevisi_ta_movafaiaghit_ranpannamayi_baraye_ayandehsazan,
    category: "برنامه نویسی",
    author: "پارسا عربی",
    upload: "شهریور 1403",
    suggested: 15,
    paragraphs: [
      {
        paragraph: [
          "امروزه برنامه‌نویسی به عنوان یکی از جذاب‌ترین و پردرآمدترین شغل‌ها شناخته می‌شود. با توجه به رشد روزافزون فناوری و نیاز به نرم‌افزارها و اپلیکیشن‌های نوین، یادگیری برنامه‌نویسی می‌تواند درهای زیادی را به روی شما باز کند. در این مقاله به بررسی مراحل و تکنیک‌هایی می‌پردازیم که با استفاده از آن‌ها می‌توانید در این زمینه موفق شوید.",
        ],
      },
      {
        title: "انتخاب زبان برنامه‌نویسی مناسب",
        paragraph: [
          "زبان‌های پرطرفدار: برای آغاز، زبان‌هایی مانند Python، JavaScript و Java را در نظر بگیرید. Python به دلیل سادگی و کاربردهای گسترده‌اش برای مبتدیان مناسب است. JavaScript نیز برای توسعه وب ضروری است. برای توسعه برنامه های تلفن همراه و انواع نرم‌افزار نیز از Java استفاده می‌شود.",
        ],
      },
      {
        title: "بررسی بازار کار",
        paragraph: [
          "پیش از انتخاب زبان، به نیازهای بازار کار در منطقه خود توجه کنید. پروژه‌هایی که در محل اقامت یا زندگیمون خواهان بیشتری دارد می‌تواند نخستویت داشته، بنابراین یادگیری زبان‌های مرتبط با آن خوب است.",
        ],
      },
      {
        title: "یادگیری اصول پایه‌ای",
        paragraph: [
          "کلاس‌های آنلاین: برای یادگیری حرفه‌ای بدون محدودیت زمان یا مکان یک کلاس آنلاین خوب انتخاب بی‌نظیریه، این روزها خیلی‌ها کلاس خصوصی آنلاین یا پکیج آموزشی اصولی را به کلاس های حضوری ترجیح میدهند. امپراتوری کد منبع خوبیه دوستان 👍🏽 میتونید به کلاس‌ها و رضایت دانشجویانمون نگاهی بندازین:",
        ],
      },
      {
        title: "تمرین و پروژه‌های عملی",
        paragraph: [
          "انجام پروژه‌های کوچک: همیشه بهترین روش برای یادگیری، انجام پروژه‌های عملی است. بکوشید پروژه‌های کوچک را ایجاد کنید، مانند یک وب‌سایت ساده یا یک اپلیکیشن موبایل ( بسته به موضوع کار و زبان). • مشارکت در پروژه‌های متن‌باز: با مشارکت در پروژه‌های متن‌باز در GitHub، می‌توانید تجربیات خود را افزایش دهید و از دیگران بیاموزید.",
        ],
      },
      {
        title: "ایجاد شبکه ارتباطی",
        paragraph: [
          "شبکه‌سازی: به رویدادهای توسعه‌دهندگان و کارگاه‌های آموزشی بپیوندید. این کار به شما کمک می‌کند تا با دیگر برنامه‌نویسان و حرفه‌ای‌ها آشنا شوید. از این رویداد ها در امپراتوری کد داریما !",
          " استفاده از پلتفرم‌های اجتماعی: از پلتفرم‌هایی مانند LinkedIn و Twitter برای برقراری ارتباط با افراد موفق در این زمینه استفاده کنید؛ اینستا هم خوبه برای آغاز.",
        ],
      },
      {
        title: "به‌روز ماندن با تکنولوژی‌ها",
        paragraph: [
          "دنبال کردن اخبار فناوری: با پیگیری وب‌سایت‌ها و بلاگ‌های معتبر مانند TechCrunch و Hacker News، می‌توانید از جدیدترین روندها و تکنولوژی‌ها مطلع شوید. با امپراتوری کد همراه باشید تا از جدیدترین ها آگاه شوید",
          "شرکت در کلاس‌های پیشرفته: پس از تسلط بر زبان‌ها و مفاهیم پایه‌ای، می‌توانید به یادگیری تکنیک‌های پیشرفته‌تری مانند یادگیری ماشین، توسعه وب و امنیت سایبری بپردازید.",
        ],
      },
      {
        title: "توسعه مهارت‌های نرم (بسیار مهم)",
        paragraph: [
          "مهارت‌های ارتباطی: توانایی برقراری ارتباط مؤثر با همکاران و مشتریان از اهمیت بالایی برخوردار است. در این راستا می‌توانید در کلاس‌های مهارت‌های ارتباطی شرکت کنید.",
          "مدیریت زمان: یادگیری چگونگی مدیریت زمان به شما کمک می‌کند تا در پروژه‌ها به موقع پیشرفت کنید و استرس کمتری داشته باشید.",
        ],
      },
      {
        title: "هدف‌گذاری و ارزیابی",
        paragraph: [
          "تنظیم اهداف کوتاه‌مدت و بلندمدت: اهداف مشخصی برای خود تعیین کنید و به شکل منظم پیشرفت خود را ارزیابی کنید. این کار به شما کمک می‌کند تا در راه پیشرفت خود پایدار و پیروز بمانید.",
          "بازخورد گرفتن: از همکاران و مربی‌ها نظرات و بازخوردهای سازنده دریافت کنید تا نقاط قوت و ضعف خود را شناسایی کنید.",
        ],
      },
      {
        title: "پایان و نتیجه‌گیری",
        paragraph: [
          "برنامه‌نویسی یک سفر هیجان‌انگیز و پر از فرصت‌های کاری است. با رعایت مراحل و تکنیک‌های گفته شده، می‌توانید در این زمینه موفق شوید و کار خود را به یک حرفه پردرآمد تبدیل کنید. به یاد داشته باشید که پیروزی به شکیبایی و پشتکار نیاز دارد و هر گام کوچک شما در این راه به سوی آینده‌ای روشن‌تر و پیروز مندانه‌تر است.",
        ],
      },
      {
        paragraph: [
          "امپراتوری کد:<br>کاری که با عشق انجام دهی سرانجامش نیکوست؛<br>در این باغ چه شوری، چه هوایی است بر ما<br>که در جستجوی عشق، دل شاد و پر شوری است بر ما",
        ],
      },
    ],
  },
  {
    title: "امپراتوری کد: جایی برای نوآوری و یادگیری",
    cover: emperatori_code_jaei_baraye_noavari_va_yadgiri,
    category: "امپراتوری",
    author: "پارسا عربی",
    upload: "شهریور 1403",
    suggested: 15,
    paragraphs: [
      {
        paragraph: [
          "در دنیای امروز، برنامه‌نویسی و فریلنسینگ (آزاد کاری) به عنوان دو زمینه پرطرفدار و پویا شناخته می‌شوند. از سال ۱۴۰۰، ما گروهی به نام «امپراتوری کد» را راه‌اندازی کرده به این زمینه‌ها ورود پیدا کردیم و به عنوان یک گروه فعال در زمینه برنامه‌نویسی و فریلنسری، تلاش کردیم تا بهترین خدمات را به علاقه‌مندان و دانشجویان ارائه دهیم.",
        ],
      },
      {
        title: "دلیل نام‌گذاری: امپراتوری کد",
        paragraph: [
          "ما برای انتخاب نام گروهمان ساعت‌ها اندیشیدیم تا نامی متفاوت و معنادار پیدا کنیم. در نهایت به دو واژه «امپراتوری» و «کد» رسیدیم. امپراتوری به یادآورنده‌ی پیشینه‌ی شکوهمند ایرانیان و قدرت و بزرگی ماست.",
          "این واژه نه تنها حس قدرت را می‌رساند، بلکه نمایانگر اصالت و پیشینه باستانی سرزمین ما نیز هست. از سوی دیگر، «کد» به دنیای برنامه‌نویسی و تمامی کدهایی که در زندگی روزمره با آن‌ها سر و کار داریم اشاره دارد. ترکیب این دو واژه، نامی جالب و معنا دار به وجود آورده که نشان‌دهنده‌ی قدرت و اهمیت کدهای برنامه‌نویسی در جهان کنونی است.",
        ],
      },
      {
        title: "فعالیت‌های ما",
        paragraph: [
          "گروه ما «امپراتوری کد» در زمینه‌های گوناگونی مشغول به کار است:",
          "• طراحی و اجرای سایت: ما به طراحی سایت‌های قوی و روان با استفاده از کمترین و درست‌ترین کدها توجه می‌کنیم تا تجربه کاربری بهتری را برای مشتریان‌مان فراهم کنیم.",
          "• آموزش برنامه‌نویسی به کودکان و نوجوانان: با تدریس برنامه‌نویسی به ویژه زبان پایتون و طراحی وب، به کودکان و نوجوانان کمک می‌کنیم تا مهارت‌های برنامه‌نویسی را بیاموزند و به دنیای تکنولوژی نزدیک‌تر شوند.",
          "• مشاوره و متودهای نوین برای برنامه‌نویسی: ارائه مشاوره‌های تخصصی و آموزش متودهای جدید به دانشجویان و علاقه‌مندان از دیگر فعالیت‌های ماست.",
          "• آموزش فریلنسری: ما به افراد کمک می‌کنیم تا با اصول فریلنسری آشنا شوند و راهنمایی‌های لازم برای شروع کار در این زمینه را دریافت کنند.",
          "پشتیبانی از دانشجویان: ما همیشه در تلاشیم تا به دانشجویان‌مان در راه پیشرفت کاری کمک کنیم و آن‌ها را در رسیدن به اهدافشان یاری دهیم.",
        ],
      },
      {
        title: "هدف ما",
        paragraph: [
          "هدف اصلی ما از راه‌اندازی گروه «امپراتوری کد»، ارائه بهترین خدمات و یاری رساندن به علاقه‌مندان به برنامه‌نویسی و فریلنسری است. ما به دنبال دیده شدن نیستیم، بلکه می‌خواهیم با نوآوری و کیفیت بالا، به جامعه برنامه‌نویسی و آزادکاری کمک کنیم.",
          "ما در «امپراتوری کد» به این باوریم که برنامه‌نویسی نه تنها یک مهارت، بلکه یک هنر است که می‌تواند زندگی را تغییر دهد. به همین دلیل، همواره در تلاش هستیم تا به بهترین نحو ممکن به این هنر بپردازیم و به دیگران نیز یاد دهیم که چگونه می‌توانند با کدهای برنامه‌نویسی، دنیای خود را دگرگون کنند.",
          "در نهایت، امیدواریم هر عزیزی که به ما می‌پیوندد، بتواند در این مسیر پرچالش و جذاب به موفقیت‌های بزرگی دست یابد. با ما همراه باشید و گام به گام در دنیای جذاب برنامه‌نویسی و فریلنسری پیش بروید.",
        ],
      },
    ],
  },
];

// {
//   title: "",
//   cover: Freelancer_Cover,
//   category: "",
//   upload: "",
//   suggested: 15,
//   paragraphs: [
//     {
//       title: "",
//       paragraph: [''],
//     },
//   ],
// },
