export const courses = [
  {
    title: "HTML,CSS",
    persianTitle: "اچ‌تی‌ام‌ال و سی‌اس‌اس",
    path: "html-css",
    category: "web",
    describe: "اصلی ترین تکنولوژی های طراحی وبسایت",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/html5/html5-original.svg",
    color: ["#2965f1", "#f06529"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "120",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "JavaScript",
    persianTitle: "جاوااسکریپت",
    path: "javascript",
    category: "web",
    describe: "زبان برنامه نویسی مخصوص ساخت و طراحی وبسایت",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/javascript/javascript-original.svg",
    color: ["#e09b31", "#ebdd4e"],
    registerLink: "/courses/register-form",
    rank: 1,
    capacity: "0",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Tailwind",
    persianTitle: "تیلویند",
    path: "tailwind",
    category: "web",
    describe: "استایل دهی پویاتر و رسپانسیو کردن اصولی تر",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/tailwindcss/tailwindcss-original.svg",
    color: ["#06b6d4", "#6d28d9"],
    registerLink: "/courses/register-form",
    rank: 1,
    capacity: "34",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Bootstrap",
    persianTitle: "بوت‌استرپ",
    path: "bootstrap",
    category: "web",
    describe: "برای رسپانسیو کردن سریع و استایل دهی آماده",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/bootstrap/bootstrap-original.svg",
    color: ["#6e44ff", "#b892ff"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "11",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Python - Beginner",
    persianTitle: "پایتون ابتدایی",
    path: "python-beginner",
    category: "software",
    describe: "شروع برنامه نویسی با پایتون مخصوص مبتدیا",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/python/python-original.svg",
    color: ["#1e96fc", "#072ac8"],
    registerLink: "/courses/register-form",
    rank: 1,
    capacity: "120",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Python - Pro",
    persianTitle: "پایتون پیشرفته",
    path: "python-professional",
    category: "software",
    describe: "مکلمل دوره ی ابتدایی برای حرفه ای شدن",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/python/python-plain.svg",
    color: ["#1e96fc", "#072ac8"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "0",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "#C",
    persianTitle: "سی شارپ",
    path: "c-sharp",
    category: "software",
    describe: "برنامه نویسی با زبان پرقدرت #C",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/csharp/csharp-original.svg",
    color: ["#7209b7", "#3a0ca3"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "0",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "++C",
    persianTitle: "سی پلاس پلاس",
    path: "c-plus-plus",
    category: "software",
    describe: "برنامه نویسی با زبان پرقدرت ++C",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/cplusplus/cplusplus-original.svg",
    color: ["#001845", "#0466c8"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "0",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Java",
    persianTitle: "جاوا",
    path: "java",
    category: "software",
    describe: "برنامه نویسی با Java (ربطی به JavaScript نداره!)",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/java/java-original.svg",
    color: ["#4c334d", "#7c2e41"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "8",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Unreal Engin 5",
    persianTitle: "آنریل انجین 5",
    path: "unreal-engin",
    category: "game",
    describe: "ساخت بازی با موتور بازی سازی Unreal Engin 5",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/unrealengine/unrealengine-original.svg",
    color: ["#2b2d42", "#8d99ae"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "120",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Unity 6",
    persianTitle: "یونیتی 6",
    path: "unity",
    category: "game",
    describe: "ساخت بازی با موتور بازی سازی Unity 6",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/unity/unity-original.svg",
    color: ["#222c37"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "20",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Scratch",
    persianTitle: "اسکرچ",
    path: "scratch",
    category: "game",
    describe: "ساخت بازی برای کودکان با موتور بازی سازی Scratch",
    price: 5000000,
    logo: "https://seeklogo.com/images/S/scratch-cat-logo-7F652C6253-seeklogo.com.png",
    color: ["#ff9100", "#ffb600"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "20",
    specs: [
      { label: "گروه سنی", describe: "همه" },
      { label: "تعداد جلسات", describe: "40" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "قیمت دوره", describe: 5000000 },
    ],
    paragraphs: [
      {
        title: "تایتل الکی",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تایتل الکی",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
];
