export const courses = [
  {
    title: "HTML,CSS",
    persianTitle: "اچ‌تی‌ام‌ال و سی‌اس‌اس",
    path: "html-css",
    category: "web",
    describe: "اصلی ترین تکنولوژی های طراحی وبسایت",
    price: 1980000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/html5/html5-original.svg",
    color: ["#2965f1", "#f06529"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "120",
    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "درباره دوره",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "در این دوره آموزشی، شما به صورت خصوصی و به زبان ساده با اصول و مبانی طراحی وب آشنا خواهید شد. ما به شما یاد خواهیم داد که چگونه با استفاده از HTML و CSS، وب‌سایت‌های زیبا و کاربرپسند بسازید.",
          "این دوره برای تمام افرادی است که می‌خواهند از صفر آغاز کنند و به دنیای برنامه‌نویسی وب وارد شوند.",
        ],
      },
      {
        title: "HTML و CSS چی هستن؟",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "اصلی ترین تکنولوژی های ساخت یک وبسایت این HTML و CSS هستند.",
          "این دو بزرگوار زبان برنامه نویسی نیستند! HTML یک زبان نشانه گزاری هست و CSS برای استایل دهی محتوایی که با HTML ساخته میشه به کار میره. یه جورایی HTML اسکلت یک خونست و CSS رنگ و ظاهر اونه که سبب میشه زیبا به چشم بیاد.",
        ],
      },
      {
        title: "کاربردهای دوره",
        paragraph: [
          "طراحی وب: با یادگیری HTML و CSS، می‌توانید وب‌سایت‌های شخصی، تجاری و یا فروشگاهی طراحی کنید.",
          "فرصت‌های شغلی: مهارت در طراحی وب به شما امکان می‌دهد تا در دنیای فریلنسری کار کنید یا در شرکت‌های فناوری استخدام شوید.",
          "ایجاد پروژه‌های شخصی: با تسلط بر این مهارت‌ها، می‌توانید پروژه‌های شخصی خود را ایجاد کنید و در دید همه به نمایش بگذارید.",
        ],
      },
      {
        paragraph: [
          "با ثبت‌نام در این دوره، شما نخستین گام بزرگ رو در دنیای جذاب برنامه‌نویسی وب خواهید گزاشت. همین حالا اقدام کنید و تجربه‌ای متفاوت را آغاز کنید!",
        ],
      },
    ],
    faq: [
      {
        quiz: "پروژه محور بودن یعنی چی؟",
        answer:
          "یعنی اینکه شما با ساخت پروژه مطالب دوره رو فرامیگیرید. یادگیری یک دانش و مهارت با انجام پروژه‌های واقعی به شما کمک می‌کند به نتیجه‌ای عالی برسید.",
      },
      {
        quiz: "من بدون هیچ پیش زمینه ای میتونم HTML و CSS یاد بگیرم؟",
        answer: "بله!",
      },
      {
        quiz: "پس از این دوره چی باید یادبگیرم؟",
        answer:
          "برای ادامه ی مسیر طراحی وب پس از این دوره باید بری سره JavaScript یا یک از فریم ورک های CSS (Tailwind یا Bootstrap)",
      },
    ],
  },
  {
    title: "JavaScript",
    persianTitle: "جاوااسکریپت",
    path: "javascript",
    category: "web",
    describe: "زبان برنامه نویسی مخصوص ساخت و طراحی وبسایت",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/javascript/javascript-original.svg",
    color: ["#e09b31", "#ebdd4e"],
    registerLink: "/courses/register-form",
    rank: 1,
    capacity: "0",
    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "درباره ی جاوااسکریپت",
        cover: "",
        paragraph: [
          "هر وبسایت با استفاده از سه تکنولوژی اساسی ساخته میشه که هیچ جایگزینی ندارن. یکی HTML، یکی CSS و زبان برنامه نویسی جاوااسکریپت. با یادیگری HTML و CSS نوبت به یادگیری JavaScript میرسه که برخلاف دو تکنولوژی پیشین، یک زبان برنامه نویسیه یعنی از تمام ویژگی های یک زبان برنامه نویسی مانند متغیر ها، فانکشن ها و منطق برخودار است.",
        ],
      },
      {
        title: "جاوااسکریپت به چه دردی میخوره",
        cover: "",
        paragraph: [
          "کاربرد جاوااسکریپت از جایی آغاز میشه که سایت ما نیاز به زنده شدن داشته باشه! جاوااسکریپت با استفاده رخداد هایی که در وبسایت اتفاق میفته نتایج گوناگونی رو برای سمت کاربر و همچنین سمت سرور رقم میزنه تا سایت ما بجز یک هنر نمایشی کاربردی هم داشته باشه. مانند یک ماشین حساب ساده ;)",
        ],
      },
      {
        title: "آینده ی پر انتخاب",
        cover: "",
        paragraph: [
          "جاوااسکریپت برای استفاده در ساخت وبسایت یه تکنولوژی همه فن حریفه! منظورم اینه که این زبان برنامه نویسی کلی تکنولوژی های وابسته داره که هر کدومش میتونه بخشی از وبسایت رو بسازه در حالی که هیچ زبان دیگه ای نیست که بتونه اینکار رو بکنه. ",
        ],
      },
      {
        title: "خوبی ها",
        cover: "",
        paragraph: [
          "جامعه ی بزرگ: جاواسکریپت یک از پرطرفدار ترین زبان های برنامه نویسی است. به این دلیل در تمام هزاران نفر هستند که با استفاده از این زبان برنامه ها و سایت های خودشون رو میسازن که همیشه میتونی در جای جای اینترنت باهاشون ارتباط داشته باشی و ازشون کمک بگیری",
          "یادیگری آسون: ساختار جاوااسکریپت بسیار ساده و منظمه که باعث میشه به آسونی هر چه تمام تر این زبان رو یادبگیری و ازش استفاده کنی.",
          "بهترین نقطه‌ی آغاز: برای تبدیل شدن به یک برنامه نویس حرفه ای باید با چیزی کارت رو شروع کنی که از تمام منطق ها برنامه نویسی بهره مند باشه و جاوااسکریپت هم همینطوره!",
          "بازارکار عالی: به دلیل کارایی و پتانسیل بالای جاوااسکریپت همیشه بازارکار خوبی برای برنامه نویس های این زبان وجود داره.",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Tailwind",
    persianTitle: "تیلویند",
    path: "tailwind",
    category: "web",
    describe: "استایل دهی پویاتر و رسپانسیو کردن اصولی تر",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/tailwindcss/tailwindcss-original.svg",
    color: ["#06b6d4", "#6d28d9"],
    registerLink: "/courses/register-form",
    rank: 1,
    capacity: "34",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Bootstrap",
    persianTitle: "بوت‌استرپ",
    path: "bootstrap",
    category: "web",
    describe: "برای رسپانسیو کردن سریع و استایل دهی آماده",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/bootstrap/bootstrap-original.svg",
    color: ["#6e44ff", "#b892ff"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "11",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Python - Beginner",
    persianTitle: "پایتون ابتدایی",
    path: "python-beginner",
    category: "software",
    describe: "شروع برنامه نویسی با پایتون مخصوص مبتدیا",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/python/python-original.svg",
    color: ["#1e96fc", "#072ac8"],
    registerLink: "/courses/register-form",
    rank: 1,
    capacity: "120",
    specs: [
      { label: "نام دوره", describe: "پایتون ابتدایی" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "دارد" },
      { label: "روش آموزش", describe: "مرحله ای" },
      { label: "زمان کل دوره", describe: "20 ساعت" },
      { label: "جلسات", describe: "20" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Python - Pro",
    persianTitle: "پایتون پیشرفته",
    path: "python-professional",
    category: "software",
    describe: "مکلمل دوره ی ابتدایی برای حرفه ای شدن",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/python/python-plain.svg",
    color: ["#1e96fc", "#072ac8"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "0",
    specs: [
      { label: "نام دوره", describe: "پایتون پیشرفته" },
      { label: "پیش نیاز", describe: "پایتون ابتدایی" },
      { label: "پشتیبانی و مشاوره", describe: "دارد" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "25 ساعت" },
      { label: "جلسات", describe: "25" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "#C",
    persianTitle: "سی شارپ",
    path: "c-sharp",
    category: "software",
    describe: "برنامه نویسی با زبان پرقدرت #C",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/csharp/csharp-original.svg",
    color: ["#7209b7", "#3a0ca3"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "0",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "++C",
    persianTitle: "سی پلاس پلاس",
    path: "c-plus-plus",
    category: "software",
    describe: "برنامه نویسی با زبان پرقدرت ++C",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/cplusplus/cplusplus-original.svg",
    color: ["#001845", "#0466c8"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "0",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Java",
    persianTitle: "جاوا",
    path: "java",
    category: "software",
    describe: "برنامه نویسی با Java (ربطی به JavaScript نداره!)",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/java/java-original.svg",
    color: ["#4c334d", "#7c2e41"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "8",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Unreal Engin 5",
    persianTitle: "آنریل انجین 5",
    path: "unreal-engin",
    category: "game",
    describe: "ساخت بازی با موتور بازی سازی Unreal Engin 5",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/unrealengine/unrealengine-original.svg",
    color: ["#2b2d42", "#8d99ae"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "120",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Unity 6",
    persianTitle: "یونیتی 6",
    path: "unity",
    category: "game",
    describe: "ساخت بازی با موتور بازی سازی Unity 6",
    price: 5000000,
    logo: "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/unity/unity-original.svg",
    color: ["#222c37"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "20",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [],
      },
      {
        title: "",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [],
      },
      {
        title: "",
        paragraph: [],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
  {
    title: "Scratch",
    persianTitle: "اسکرچ",
    path: "scratch",
    category: "game",
    describe: "ساخت بازی برای کودکان با موتور بازی سازی Scratch",
    price: 5000000,
    logo: "https://seeklogo.com/images/S/scratch-cat-logo-7F652C6253-seeklogo.com.png",
    color: ["#ff9100", "#ffb600"],
    registerLink: "/courses/register-form",
    rank: 2,
    capacity: "20",

    specs: [
      { label: "نام دوره", describe: "HTML و CSS" },
      { label: "پیش نیاز", describe: "هیچی" },
      { label: "پشتیبانی و مشاوره", describe: "" },
      { label: "روش آموزش", describe: "پروژه محور" },
      { label: "زمان کل دوره", describe: "30 ساعت" },
      { label: "جلسات", describe: "30" },
    ],
    paragraphs: [
      {
        title: "درباره دوره",
        cover:
          "https://camo.githubusercontent.com/21bb8ae3629c4852404841252c65baa38426e4c0d01a68a0f7e6fd121d4649dc/68747470733a2f2f7777772e69696d2e66722f65636f6c652d7765622f77702d636f6e74656e742f75706c6f6164732f323031372f30312f48544d4c352e6a7067",
        paragraph: [
          "این دوره آموزشی به صورت جامع و ساده نحوه کار با Scratch Junior را آموزش می‌دهد . هدف از این دوره ، یادگیری اصول برنامه‌نویسی به‌همراه خلق پروژه‌های جذاب و سرگرم‌کننده است . کد آموزان با استفاده از پروژه‌های تعاملی و جذاب ، مهارت‌های ساخت بازی و انیمیشن را کسب می‌کنند .",
        ],
      },
      {
        title: "معرفی Scratch Junior",
        cover:
          "https://www.dreamhost.com/blog/wp-content/smush-webp/2023/04/HTML-versus-CSS-1.jpg.webp",
        paragraph: [
          "Scratch Junior یک محیط بازی سازی و برنامه نویسی است که با استفاده از بلوک‌های گرافیکی ، به کاربران اجازه می‌دهد داستان‌ها ، بازی‌ها و انیمیشن‌های خود را بسازند . این نرم‌افزار با هدف آموزش اصول اولیه بازی‌سازی و برنامه‌نویسی طراحی شده است و کاربران بدون نیاز به خواندن یا نوشتن کد می‌توانند به راحتی پروژه‌های خلاقانه‌ای مانند بازی‌ها و انیمیشن را طراحی کنند .",
        ],
      },
      {
        title: "مسیر دوره",
        hints: [
          "مبانی اولیه و آشنایی با محیط Scratch Junior",
          "معرفی منابع متریال",
          "شروع ساخت اولین بازی",
        ],
      },
    ],
    faq: [
      {
        quiz: "برنامه نویسی چیه؟",
        answer:
          "دانشی برای انتقال دستورات و ایده‌ها به کامپیوتر و فضای اینترنت.",
      },
      {
        quiz: "برنامه نویسی شامل چه چیزایی هست (از چه چیزایی ساخته شده؟)",
        answer: "از انواع گوناگونی از زبان‌های برنامه‌نویسی و فریم ورک‌ها",
      },
      {
        quiz: "کاربرد برنامه نویسی چیه؟",
        answer:
          "ارتباط با ساختار مفاهیم و نرم افزارهای کامپیوتر برای ایجاد تغییرات و بروزرسانی آنها، یا حتی پیدایش چیزایی جدید در آنها... مثلا: ویندوز (Windows) یا هر سیستم عامل و نرم افزاری با دانش برنامه‌نویسی ساخته شده. وب‌سایت‌ها و بازی‌ها و هوش مصنوعی هم همینطور.",
      },
      {
        quiz: "بازار کار و درآمد برنامه نویسی چطوره؟",
        answer:
          "اگر تلاشتون خوب باشه و اصولی یاد بگیرید نه تنها عالیه بلکه روبه رشد هم هست. (میتونی از ما مشاوره بگیری)",
      },
    ],
  },
];

export const courseBenefits = [
  {
    title: "بروز بودن لحظه ای",
    icon: "fa-duotone fa-solid fa-books",
    describe:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان.",
  },
  {
    title: "تعهد و مسئولیت پذیری",
    icon: "fa-duotone fa-solid fa-handshake",
    describe:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان.",
  },
  {
    title: "ارتباط مستقیم",
    icon: "fa-duotone fa-solid fa-people-arrows",
    describe:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان.",
  },
  {
    title: "مدرک بین المللی",
    icon: "fa-duotone fa-solid fa-sparkles",
    describe:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان.",
  },
];

export const coursesQuestions = [
  {
    quiz: "دوره ی آنلاین خصوصی؟",
    answer:
      "دوره ی آنلاین خصوصی یعنی ارتباط مستقیم بین مربی و دانشجو که در بستر اینترنت برای برگزاری کلاس ها صورت میگیره",
  },
  {
    quiz: "کدوم دوره به درد من میخوره؟",
    answer:
      "مهم اینه که از چی بیشتر خوشت میاد. همیشه مشاور های امپراتوری آماده اند تا توی بهترین انتخاب راهنماییت کنن :)",
  },
  {
    quiz: "طراحی سایت چه فرقی با برنامه نویسی داره؟",
    answer:
      "طراحی سایت یک شاخه ی متمرکز از برنامه نویسیه درحالی که زبان های برنامه نویسی کاربرد های دیگه ای هم دارند.",
  },
  {
    quiz: "چه چیزی برای آغاز نیاز دارم؟",
    answer:
      "تنها علاقه و ثبت نام کردن. (البته برخی دوره ها پیشنیاز مشخصی دارن که میتونی توی صفحه ی مربوط ببینیشون)",
  },
  {
    quiz: "مدرک بین المللی به چه کاری میاد؟",
    answer: "این مدرک در هر جایی مهارت شمارو تصدیق ",
  },
];
