import Persians_Parade from "../assets/persians_parade.jpg";
import Persian_Coder_2 from "../assets/painting_of_an_ancient_parthian_imperial_philosophers_while_their_coding_in_their_laptop_in_front_perspolis_png.png";

export const services = [
  {
    title: "طراحی سایت",
    cover: Persian_Coder_2,
    path: "web-development",
    availability: true,
    describe:
      "طراحی، ساخت و راه اندازی سایت به سلیقه ی شما. ما فکر شمارو به کد تبدیل میکنیم.",
    icon: "fa-light fa-browser",
    link: {
      label: "شروع کار",
      path: "/",
    },
    details: [
      { label: "نوع کار", describe: "حضوری" },
      { label: "پرداخت هزینه", describe: "ماهیانه" },
      { label: "حداقل زمان", describe: "2 ماه" },
      { label: "عنوان کار", describe: "آموزش" },
    ],
    paragraphs: [
      {
        title: "چکیده ی کار",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "کاری که باهم میکنیم",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تعهدات ما",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
  },
  {
    title: "آموزش برنامه نویسی",
    cover: Persian_Coder_2,
    path: "private-course",
    availability: true,
    describe:
      "دوره های برنامه نویسی و بازی سازی به شکل کاملا خصوصی، هم آنلاین هم فیزیکی!",
    icon: "fa-light fa-chalkboard-user",
    link: {
      label: "شروع کار",
      path: "/",
    },
    details: [
      { label: "نوع کار", describe: "حضوری" },
      { label: "پرداخت هزینه", describe: "ماهیانه" },
      { label: "حداقل زمان", describe: "2 ماه" },
      { label: "عنوان کار", describe: "آموزش" },
    ],
    paragraphs: [
      {
        title: "چکیده ی کار",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "کاری که باهم میکنیم",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تعهدات ما",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
  },
  {
    title: "مشاوره وبسایت",
    cover: Persian_Coder_2,
    path: "website-counseling",
    availability: true,
    describe:
      "ما میتونیم توی راه اندازی سایت یا کسب و کار اینترنتیت بهت مشاوره بدیم.",
    icon: "fa-sharp fa-light fa-globe-pointer",
    link: {
      label: "شروع کار",
      path: "/",
    },
    details: [
      { label: "نوع کار", describe: "حضوری" },
      { label: "پرداخت هزینه", describe: "ماهیانه" },
      { label: "حداقل زمان", describe: "2 ماه" },
      { label: "عنوان کار", describe: "آموزش" },
    ],
    paragraphs: [
      {
        title: "چکیده ی کار",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "کاری که باهم میکنیم",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تعهدات ما",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
  },
  {
    title: "راه اندازی وبسایت",
    cover: Persian_Coder_2,
    path: "website-deployment",
    availability: true,
    describe:
      "اگه از پیش وبسایتی داری و برای راه اندازیش کمک میخوای ما هستیم:)",
    icon: "fa-light fa-layer-group",
    link: {
      label: "شروع کار",
      path: "/",
    },
    details: [
      { label: "نوع کار", describe: "حضوری" },
      { label: "پرداخت هزینه", describe: "ماهیانه" },
      { label: "حداقل زمان", describe: "2 ماه" },
      { label: "عنوان کار", describe: "آموزش" },
    ],
    paragraphs: [
      {
        title: "چکیده ی کار",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "کاری که باهم میکنیم",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
      {
        title: "تعهدات ما",
        paragraph: [
          "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
        ],
      },
    ],
  },
];

export const servicePage = {
  halfs: [
    {
      title: "این امپراتوری دقیقا چیه؟",
      describe:
        "امپراتوری کد یک تیم بسیار منسجم و قدرتمنده که میخواد تمام دنیای وبسایت ها و اپ هارو تصرف کنه و دگرگونی اساسی ای توش انجام بده. تمام سربازان امپراتوری برای این حقیقت که طراحی و کد زدن رو به بهترین سطح برسونن تا دیگه هیچ کس بجر کد های تمیز، طراحی های دلنواز و زیبا و برنامه هایی با کاربری بسیار راحت و سبک نتونه تو دنیا پیدا کنه!",
      cover: Persians_Parade,
    },
    {
      title: "این امپراتوری دقیقا چیه؟",
      describe:
        "امپراتوری کد یک تیم بسیار منسجم و قدرتمنده که میخواد تمام دنیای وبسایت ها و اپ هارو تصرف کنه و دگرگونی اساسی ای توش انجام بده. تمام سربازان امپراتوری برای این حقیقت که طراحی و کد زدن رو به بهترین سطح برسونن تا دیگه هیچ کس بجر کد های تمیز، طراحی های دلنواز و زیبا و برنامه هایی با کاربری بسیار راحت و سبک نتونه تو دنیا پیدا کنه!",
      cover: Persians_Parade,
    },
  ],
  overall: {
    title: "ما چیزایی رو تو این مطالب گفتیم که همه نیاز دارن",
    describe: "اگه چیزی میخوای که تو مطالب سایت نیست بهتره باهامون تماس بگیری",
    links: [
      {
        link: "mailto:duckdukstay@hotmail.com",
        label: "ارسال ایمیل",
      },
      {
        link: "/contact",
        label: "فرم تماس",
      },
    ],
  },
};
